#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_sql_database.jade-datarepo-db-11 will be created
  + resource "google_sql_database" "jade-datarepo-db-11" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "datarepo"
      + project   = "broad-jade-integration"
      + self_link = (known after apply)
    }

  # google_sql_database.jade-stairway-db-11 will be created
  + resource "google_sql_database" "jade-stairway-db-11" {
      + charset   = "UTF8"
      + collation = "en_US.UTF8"
      + id        = (known after apply)
      + instance  = (known after apply)
      + name      = "stairway"
      + project   = "broad-jade-integration"
      + self_link = (known after apply)
    }

  # google_sql_database_instance.jade_11_postgres_db[0] will be created
  + resource "google_sql_database_instance" "jade_11_postgres_db" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_11"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = (known after apply)
      + private_ip_address            = (known after apply)
      + project                       = (known after apply)
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy      = "ALWAYS"
          + availability_type      = (known after apply)
          + crash_safe_replication = (known after apply)
          + disk_autoresize        = true
          + disk_size              = (known after apply)
          + disk_type              = (known after apply)
          + pricing_plan           = "PER_USE"
          + replication_type       = "SYNCHRONOUS"
          + tier                   = "db-g1-small"
          + user_labels            = {
              + "app"   = "jade"
              + "role"  = "database"
              + "state" = "active"
            }
          + version                = (known after apply)

          + backup_configuration {
              + binary_log_enabled = false
              + enabled            = true
              + start_time         = "06:00"
            }

          + database_flags {
              + name  = "max_connections"
              + value = "1024"
            }

          + ip_configuration {
              + ipv4_enabled    = false
              + private_network = "https://www.googleapis.com/compute/v1/projects/broad-jade-integration/global/networks/integration-network"
              + require_ssl     = true

              + authorized_networks {
                  + name  = "Broad"
                  + value = "69.173.64.0/18"
                }
              + authorized_networks {
                  + name  = "kubernetes"
                  + value = "35.190.65.75"
                }
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }
        }
    }

  # google_sql_user.jade-db-user-11 will be created
  + resource "google_sql_user" "jade-db-user-11" {
      + id       = (known after apply)
      + instance = (known after apply)
      + name     = "drmanager"
      + password = (sensitive value)
      + project  = "broad-jade-integration"
    }

  # random_id.db_name_suffix will be created
  + resource "random_id" "db_name_suffix" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions to validate/plan TF files`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
